bit-finance/Enums/бит_ПоставщикиИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ПоставщикиИИ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>OpenAI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Gemini</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Yandex</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GigaChat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RuTronix</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_МетодыОбработкиВложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_МетодыОбработкиВложений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>APIМодели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтрокаBase64</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисРаспознавания</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_ПоставщикиИИ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает параметры сервиса взаимодействия поставщика по-умолчанию.
//
// Параметры:
//	Поставщик - ПеречислениеСсылка.бит_ПоставщикиИИ.
//
// Возвращаемое значение:
//	Структура.
//
Функция ПараметрыПоставщикаПоУмолчанию(Поставщик) Экспорт
	
	ПараметрыПоставщика = Новый Структура;
	ПараметрыПоставщика.Вставить("АдресСервера", "");
	ПараметрыПоставщика.Вставить("АдресРесурса", "");
	ПараметрыПоставщика.Вставить("АдресРесурсаФайлов", "");
	ПараметрыПоставщика.Вставить("МетодОбработкиВложений", Перечисления.бит_МетодыОбработкиВложений.СтрокаBase64);
	
	Если Поставщик = Перечисления.бит_ПоставщикиИИ.OpenAI Тогда
		ПараметрыПоставщика.АдресСервера           = "api.openai.com";
		ПараметрыПоставщика.АдресРесурса           = "v1/chat/completions";
		ПараметрыПоставщика.АдресРесурсаФайлов     = "v1/files";
		ПараметрыПоставщика.МетодОбработкиВложений = Перечисления.бит_МетодыОбработкиВложений.APIМодели;
	ИначеЕсли Поставщик = Перечисления.бит_ПоставщикиИИ.Gemini Тогда
		ПараметрыПоставщика.АдресСервера           = "generativelanguage.googleapis.com";
		ПараметрыПоставщика.АдресРесурса           = "v1beta/models";
		ПараметрыПоставщика.АдресРесурсаФайлов     = "upload/v1beta/files";
		ПараметрыПоставщика.МетодОбработкиВложений = Перечисления.бит_МетодыОбработкиВложений.APIМодели;
	ИначеЕсли Поставщик = Перечисления.бит_ПоставщикиИИ.Yandex Тогда
		ПараметрыПоставщика.АдресСервера = "llm.api.cloud.yandex.net";
		ПараметрыПоставщика.АдресРесурса = "foundationModels/v1/completion";
	ИначеЕсли Поставщик = Перечисления.бит_ПоставщикиИИ.RuTronix Тогда
		ПараметрыПоставщика.АдресСервера           = "api.rutronix.ai";
		ПараметрыПоставщика.АдресРесурса           = "functions/v1/chat-completions";
		ПараметрыПоставщика.АдресРесурсаФайлов     = "functions/v1/files";
		ПараметрыПоставщика.МетодОбработкиВложений = Перечисления.бит_МетодыОбработкиВложений.APIМодели;
	ИначеЕсли Поставщик = Перечисления.бит_ПоставщикиИИ.GigaChat Тогда
		ПараметрыПоставщика.АдресСервера           = "gigachat.devices.sberbank.ru";
		ПараметрыПоставщика.АдресРесурса           = "api/v1/chat/completions";
		ПараметрыПоставщика.АдресРесурсаФайлов     = "api/v1/files";
		ПараметрыПоставщика.МетодОбработкиВложений = Перечисления.бит_МетодыОбработкиВложений.APIМодели;
	КонецЕсли;
	
	Возврат ПараметрыПоставщика;
	
КонецФункции

Функция ОписаниеПараметровПоставщика(Поставщик) Экспорт
	
	ОписаниеПараметров = Новый Структура;
	ОписаниеПараметров.Вставить("ВидыМоделей", Новый Массив);
	ОписаниеПараметров.Вставить("ИнформацияОПоставщике", "");
	
	ВидыМоделей = ОписаниеПараметров.ВидыМоделей;
	
	Если Поставщик = Перечисления.бит_ПоставщикиИИ.OpenAI Тогда
		ВидыМоделей.Добавить("ChatGPT-4o");
		ВидыМоделей.Добавить("GPT-4.1 mini");
		ВидыМоделей.Добавить("GPT-4.1 nano");
		ВидыМоделей.Добавить("GPT-4.1");
		ВидыМоделей.Добавить("GPT-4o Audio");
		ВидыМоделей.Добавить("GPT-4o mini Audio");
		ВидыМоделей.Добавить("GPT-4o mini");
		ВидыМоделей.Добавить("GPT-4o");
		ВидыМоделей.Добавить("o1-mini");
		ВидыМоделей.Добавить("o1-pro");
		ВидыМоделей.Добавить("o1");
		ВидыМоделей.Добавить("o3-mini");
		ВидыМоделей.Добавить("o3");
		ВидыМоделей.Добавить("o4-mini");
	ИначеЕсли Поставщик = Перечисления.бит_ПоставщикиИИ.Gemini Тогда
		ВидыМоделей.Добавить("gemini-1.5-flash");
		ВидыМоделей.Добавить("gemini-1.5-pro");
		ВидыМоделей.Добавить("gemini-2.0-flash");
		ВидыМоделей.Добавить("gemini-2.0-flash-lite");
		ВидыМоделей.Добавить("gemini-2.5-flash");
		ВидыМоделей.Добавить("gemini-2.5-flash-lite");
		ВидыМоделей.Добавить("gemini-2.5-pro");
		ВидыМоделей.Добавить("gemini-pro");
		ВидыМоделей.Добавить("gemini-pro-vision");
	ИначеЕсли Поставщик = Перечисления.бит_ПоставщикиИИ.Yandex Тогда
		ВидыМоделей.Добавить("YandexGPT");
		ВидыМоделей.Добавить("YandexGPT-32k");
		ВидыМоделей.Добавить("YandexGPT-lite");
	ИначеЕсли Поставщик = Перечисления.бит_ПоставщикиИИ.GigaChat Тогда
		ВидыМоделей.Добавить("GigaChat-2");
		ВидыМоделей.Добавить("GigaChat-2-Pro");
		ВидыМоделей.Добавить("GigaChat-2-Max");
	ИначеЕсли Поставщик = Перечисления.бит_ПоставщикиИИ.RuTronix Тогда
		ОписаниеПараметров.ИнформацияОПоставщике = НСтр("ru='Сайт поставщика https://rutronix.ai'");
		
		ВидыМоделей.Добавить("one-perfect-answer");
		ВидыМоделей.Добавить("deepseek-chat");
		ВидыМоделей.Добавить("deepseek-reasoner");
		ВидыМоделей.Добавить("grok-4-1-fast-reasoning");
		ВидыМоделей.Добавить("grok-4-1-fast-non-reasoning");
		ВидыМоделей.Добавить("claude-sonnet-4-5");
		ВидыМоделей.Добавить("claude-opus-4-5");
		ВидыМоделей.Добавить("claude-haiku-4-5");
		ВидыМоделей.Добавить("gpt-5.2");
		ВидыМоделей.Добавить("gpt-5.1");
		ВидыМоделей.Добавить("gpt-5-mini");
		ВидыМоделей.Добавить("gpt-5-nano");
		ВидыМоделей.Добавить("gemini-2.5-flash");
		ВидыМоделей.Добавить("gemini-2.5-pro");
		ВидыМоделей.Добавить("gemini-3-pro-preview");
		ВидыМоделей.Добавить("sonar");
		ВидыМоделей.Добавить("sonar-pro");
	КонецЕсли;
	
	Возврат ОписаниеПараметров;
	
КонецФункции

#КонецОбласти

#КонецЕсли
